case1_1D/constant/SOLID_Thickness/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/SOLID_Thickness/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       7;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       15;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       23;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       31;
    }
    SOLID_Thickness_to_domain0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1;
        startFace       39;
        sampleMode      nearestPatchFace;
        sampleRegion    domain0;
        samplePatch     domain0_to_SOLID_Thickness;
    }
    SOLID_Thickness_to_domain2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1;
        startFace       40;
        sampleMode      nearestPatchFace;
        sampleRegion    domain2;
        samplePatch     domain2_to_SOLID_Thickness;
    }
)

// ************************************************************************* //
