case1_1D/constant/domain0/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/domain0/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20;
        startFace       19;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20;
        startFace       39;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20;
        startFace       59;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20;
        startFace       79;
    }
    wall_leftparticle
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }
    domain0_to_SOLID_Thickness
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1;
        startFace       100;
        sampleMode      nearestPatchFace;
        sampleRegion    SOLID_Thickness;
        samplePatch     SOLID_Thickness_to_domain0;
    }
)

// ************************************************************************* //
