case1_1D/constant/domain2/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/domain2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152;
        startFace       151;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152;
        startFace       303;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152;
        startFace       455;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          152;
        startFace       607;
    }
    inlet_Radiation
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       759;
    }
    domain2_to_SOLID_Thickness
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1;
        startFace       760;
        sampleMode      nearestPatchFace;
        sampleRegion    SOLID_Thickness;
        samplePatch     SOLID_Thickness_to_domain2;
    }
)

// ************************************************************************* //
