case1_1D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180;
        startFace       179;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180;
        startFace       359;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180;
        startFace       539;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180;
        startFace       719;
    }
    wall_leftparticle
    {
        type            patch;
        nFaces          1;
        startFace       899;
    }
    inlet_Radiation
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       900;
    }
)

// ************************************************************************* //
