case1_1D/constant/domain2/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	inlet_Radiation
	{
	    type        transparent;

	    wallAbsorptionEmissionModel
	    {
		   type                  constantAbsorption;
		   absorptivity     1.0;
		   emissivity         1.0;
		   E                         0.0;
	    }
	}



	domain2_to_SOLID_Thickness
	{
		type                  lookup;
		absorptivity    1.0;
		emissivity        1.0;
	}


// ************************************************************************* //
