case1_1D/0/domain2/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/domain2";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pgInitial	          1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pgInitial;

boundaryField
{
	    
	   domain2_to_SOLID_Thickness		
	    {
                type            fixedFluxPressure;
                value           uniform 1e5;
	    }
	    
            ".*"
            {
                type            totalPressure;
                p0              $internalField;
            }
            
	"front|back|top|bottom"
 		{
 			type		empty; 
 		}
}
// ************************************************************************* //


