case1_1D/0/domain2/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	   domain2_to_SOLID_Thickness		
            {
                type             greyDiffusiveRadiation;
                value           uniform 0;
            }   
            
	    inlet_Radiation 
	    {
		    type            	        greyDiffusiveRadiation;
                    value                           uniform 0;
	     }	    
	    		    
	"front|back|top|bottom"
 		{
 			type		empty; 
 		}
}	                
// ************************************************************************* //
