case1_1D/0/domain2/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/FLUID_cavity";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
	   domain2_to_SOLID_Thickness		
	    {
                type            epsilonWallFunction;
                value           uniform 0.01;
	    }
	    
	    inlet_Radiation 
	    {
                type            epsilonWallFunction;
                value           uniform 0.01;	    
	    }
	    
            "front|back|top|bottom"
 		{
 			type		empty; 
 		}
}
// ************************************************************************* //

