case1_1D/0/domain2/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/domain2";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
	".*"
            {
                type                inletOutlet;
                inletValue      uniform 0.1;
                value               uniform 0.1;
            }
	    
	   domain2_to_SOLID_Thickness	
	    {
                type            kqRWallFunction;
                value           uniform 0.1;
	    }
	    
	"front|back|top|bottom"
 		{
 			type		empty; 
 		}

}
// ************************************************************************* //


