case1_1D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class         dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

D 	        0.0035;  //D=thickness of tube reactor 

xmin 	0;
xmax 	#calc "($D * 22.5)";

ymin 0;
ymax #calc "($xmax/10)";

zmin 0;
zmax #calc "($ymax)/2";

x_seperate_particle 0;

x_seperate_tubeThickness $D;

xmin_tubeThickness    #calc   "$x_seperate_particle + (2.5*$D)";
xmax_tubeThickness    #calc  "$xmin_tubeThickness + $x_seperate_tubeThickness";

actions
(   
    {
        name    SOLID_Thickness;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ($xmin_tubeThickness $ymin $zmin) ($xmax_tubeThickness $ymax $zmax);
        }
    }
    
    {
        name    SOLID_Thickness;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set SOLID_Thickness;
        }
    }       
);

// ************************************************************************* //
